#include <htc.h>
#include <osa.h>



//------------------------------------------------------------------------------
// Задаем биты конфигурации:
//   - внутренний RC-генератор
//   - отключаем WDT
//   - отключаем низковольтное программирование
//   - отключаем функцию отладки
//------------------------------------------------------------------------------

__CONFIG(INTIO & WDTDIS & PWRTEN & MCLRDIS & LVPDIS & UNPROTECT & BORDIS 
               & IESODIS & FCMDIS & DEBUGDIS);


//------------------------------------------------------------------------------
//  Определеяем выводы для управления светодиодами
//------------------------------------------------------------------------------

#define PIN_LED1    RD0
#define PIN_LED2    RD1
#define PIN_LED3    RD2

//------------------------------------------------------------------------------
//  Параметры таймера:
//  - прескейлер = 4, 
//  - постскейлер = 1,
//  - предел счета = 250
// 
//  Тактовая частота контроллера = 4 МГц.
// 
//  Период возникновения прерывания по TMR2 получается 
//  равным 4 * 1 * 250 * Tcyc = 1 ms
// 
//------------------------------------------------------------------------------

#define PR2_CONST       250-1
#define TMR2_PRS        1                           // prs = 4
#define TMR2_POST       0                           // post = 1
#define T2CON_CONST     (TMR2_POST<<3) | TMR2_PRS


//******************************************************************************
//  Прерывание. Возникает каждую мс
//******************************************************************************

void interrupt isr (void)
{
    if (TMR2IF)
    {   
        OS_Timer();
        TMR2IF = 0;
    }
}



//******************************************************************************
//  Функции-задачи
//******************************************************************************

void Task_LED1 (void)
{
    for (;;)
    {
        OS_Bsem_Wait(BS_FLASH);  // Дожидаемся семафора
        PIN_LED1 ^= 1;           // Изменяем состояние первого светожиода
    }
}

//-----------------------------------------------------------------------------

void Task_LED2 (void)
{
    for (;;)
    {
        OS_Bsem_Wait(BS_FLASH);  // Дожидаемся семафора
        PIN_LED2 ^= 1;           // Изменяем состояние второго светожиода
    }
}

//-----------------------------------------------------------------------------

void Task_LED3 (void)
{
    for (;;)
    {
        OS_Bsem_Wait(BS_FLASH);  // Дожидаемся семафора
        PIN_LED3 ^= 1;           // Изменяем состояние третьего светожиода
    }
}

//-----------------------------------------------------------------------------

void Task_Signal (void)
{
    for (;;)
    {
        OS_Bsem_Set(BS_FLASH);
        OS_Delay(200);
    }
}

//******************************************************************************
//  Инициализация периферии
//******************************************************************************

void init (void)
{
    //------------------------------------------------------------------------------
    //  Настройка портов I/O
    //------------------------------------------------------------------------------

    PORTA = 0;
    PORTB = 0;
    PORTC = 0;
    PORTD = 0;

    TRISA = 0;
    TRISB = 0;
    TRISC = 0;
    TRISD = 0;

    //------------------------------------------------------------------------------
    //  Настройка таймера 2
    //------------------------------------------------------------------------------

    PR2 = PR2_CONST;
    T2CON = T2CON_CONST | 0x04;
                                        
    //------------------------------------------------------------------------------
    //  Настройка прерываний
    //------------------------------------------------------------------------------

    PIR1 = 0;
    PIR2 = 0;
    INTCON = 0;

    TMR2IE = 1;         // Разрешаем прерываие по TMR2
    PEIE = 1;           // Разрешаем периферийные прерывания
                        // Глобальный бит разрешения прерываний будет 
                        // установлен непосредственно перед запуском
                        // планировщика в функции main()

}

//******************************************************************************
//  main
//******************************************************************************

void main (void)
{
    // Инициализация периферии
    init();

    // Инициализация системы
    OS_Init();

    // Создание задач
    OS_Task_Create(3, Task_Signal);
    OS_Task_Create(3, Task_LED1);
    OS_Task_Create(3, Task_LED2);
    OS_Task_Create(3, Task_LED3);

    // Разрешение прерываний
    OS_EI();

    // Запуск планировщика
    OS_Run();
}



